drafts/content/org-html-themes-personal/site.org
#+OPTIONS: num:nil
#+LANGUAGE: es
#+INCLUDE: ./../header.org
#+HTML_LINK_HOME: /
#+HTML_LINK_UP: /blog.html

* RhylooSolutions (por detrás).
:PROPERTIES:
:CUSTOM_ID: un-ingeniero-en-problemas-por-detr-s
:END:

Mi sitio web ha tenido muchos cambios, haciendo una cuenta rápida entre 6 y 10  cambios grandes, los archivos de texto o la idea original de lo que quería exponer siempre se han mantenido más o menos constante, la ventaja de trabajar en texto plano; los cambios se han producido principalmente en el *"workflow"* he pasado por generar un sitio desde la mina, picando con código ~HTML~ Y ~css~ desde cero, algo que no recomiendo a nadie si no quiere perder las ganas de vivir o al menos de usar el lenguaje de marcado, hasta llegar a frameworks como HUGO y JEKYLL.

Me encantaría tener una foto de todos los formatos por los que he pasado... una pena que en su momento no pensara en el valor que tendría, si escribía esto, supongo que era porque escribir una entrada del blog no era tan fácil, implicaba copiar el código que había escrito comentarlo, multiplicar por cientos los archivos generados, vamos un autentico coñazo y lo digo yo que soy el escritor... por suerte EMACS estaba ahí para solucionar mi vida, algo que detallaré más adelante, aunque me parece que tengo algunas capturas.

Estaría bien enumerar esos  métodos usados "por las risas" o por empezar a llevar un control y rescatar algunas fotos que habrá hecho de mi sitio la [[https://archive.org/web/][Wayback Machine]], una vez más el *backup* salvándonos el culo.

Hay otra "persona" que conoce los cambios que ha sufrido mi sitio, [[https://github.com/rhyloo/rhyloo.github.io/network][Github]], evidentemente si usas git para control de versiones debería tenerlo todo, pues no, yo creaba un repositorio nuevo con cada cambio, que las ramas deben estar limpias y no mostrar errores, es código e internet deben mantenerse los cambios, en fin, sigamos.

Por ahora recuerdo estos:
- HTML y CSS puro.
- Org Mode (mal)
- Wordpress
- JEKYLL
- HUGO
- Org Mode (actual)

Ahora lo idea sería comentar cada uno, adjuntar captura si la tengo y decir porqué Org Mode (mal) y porqué Org Mode otra vez, pero lo dejaré para otro artículo ahora lo que importa es como está hecho este sitio.
*** HTML y CSS                                                         :noexport:
:PROPERTIES:
:CUSTOM_ID: html-y-css
:END:

Corrían los años 2000 era un joven neonato, la era de la informática en su máximo apogeo y yo durmiendo como un bebé, nunca mejor dicho, pues eso que empecé a estudiar "programación" por mi cuenta 11 años después del apogeo, evidentemente la clásica web estática con el html en plano ya había pasado de moda, pero, no tenía ni idea.

Visité muchas páginas como Wikipedia-fuente confiable de información para informarme de esto de programar, HTML tenía una sintaxis fácil y me gustaba porque era tangible a diferencia de C++ o PHP que en ese entonces no
https://web.archive.org/web/20120930205332/http://desarrolloweb.com/

* Desde el lodo al éxito
:PROPERTIES:
:CUSTOM_ID: desde-el-lodo-al-xito
:END:
*¿Por qué Org Mode?*
Bueno, porque uso EMACS, diría que es broma pero es una realidad usar EMACS y su entorno es lo que mejor funciona, esta entrada de blog servirá como generador de css y como artículo, y los bloques de código fuente que ves aquí se guardan en un archivo .css directamente evitando el molesto copy&paste que tenía que hacer en los otros frameworks, trabajar con el teclado me encanta apenas y tengo que tocar el ratón y bueno poco más, lo que más valoro es el workflow.

#+name: sh-tree
#+begin_src sh :results verbatim :exports both
tree -a ./../../content -I "*~"
#+end_src

#+results: sh-tree
#+begin_example
./../../content
├── docs
│   └── recipe.pdf
├── header.org
├── images
│   ├── aa.svg
│   ├── banner_picture.jpg
│   ├── contour.svg
│   ├── dot_success.svg
│   ├── filter_chebyshev_low_pass_1.png
│   ├── filter_chebyshev_low_pass_2.png
│   ├── filter_chebyshev_low_pass_3.png
│   ├── fsa.svg
│   ├── github.png
│   ├── logo.png
│   ├── mastermind_game_easy.png
│   ├── mastermind.png
│   ├── matlab-file-exchange.svg
│   ├── real_programmers.png
│   ├── recipe.png
│   ├── TDDS_progress1.png
│   ├── TDDS_wiwt.png
│   └── WIN95.png
├── index.org
├── org-html-themes-personal
│   ├── .#site.org -> rhyloo@rhylap.139473:1671913051
│   └── site.org
├── posts
│   ├── 2021-07-21-seguridad-en-la-piscina.org
│   ├── archive
│   │   ├── 2021-05-19-mi-primer-post.org
│   │   ├── 2021-05-19-seguridad-sobrevalorada.org
│   │   ├── 2021-05-20-colpitts-0---rhyloo-1.org
│   │   ├── 2021-05-24-segundo-post.org
│   │   ├── 31052021_emacs_portable.org_archive
│   │   └── como_escribir_un_blog.org
│   └── drafts
│       └── 31052021_emacs_portable.org
├── proyectos
│   ├── archive
│   │   ├── ControlSymbs.md
│   │   ├── LaTeX_Templates.md
│   │   ├── Mastermind.md
│   │   ├── problema_puntuable_3.org
│   │   ├── TDDS.md
│   │   ├── Telegram_Bot.md
│   │   └── telegram_bot.org
│   ├── controlsymbs.org
│   ├── #filtro_chevyshev.org#
│   ├── filtro_chevyshev.org
│   ├── mastermind.org
│   ├── template_recipes.org
│   └── universibot.org
├── sitemap.org
└── sites
    ├── aboutme.org
    ├── blog.org
    ├── _index.org
    ├── libros.org
    ├── miscelanea.org
    ├── peliculas.org
    └── proyectos.org

9 directories, 52 files
#+end_example

* Cooked style
:PROPERTIES:
:header-args+: :mkdirp yes :tangle ./../../docs/org-html-themes-personal/site.css
:CUSTOM_ID: cooked-style
:END:

