WebPage/docs/org-html-themes-personal/site.html
<!DOCTYPE html>
<html lang="es">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>RhylooSolutions</title>
<meta name="generator" content="Org mode">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<header>
<h1 class="title">RhylooSolutions</h1>
</header>
<!--- <link rel="stylesheet" href="https://beepb00p.xyz/assets/css/default.css"/>
<link href="https://beepb00p.xyz/assets/css/posts-list.css" rel="stylesheet"/>
<link href="https://beepb00p.xyz/assets/css/links.css" rel="stylesheet"/> !---> 

<link href="/org-html-themes-personal/site.css" rel="stylesheet"/> 

<link href="https://fonts.gstatic.com" rel="preconnect"/>
<link href="https://fonts.googleapis.com/css2?family=Source+Serif+Pro&amp;display=swap" rel="stylesheet"/>

<style>
.banner {
    font-family: "Source Serif Pro", serif;
    align-items: center;
    justify-content: center;
    text-align: center;
    
}
    

ul{
  list-style-type: none;
  display: inline;
  justify-content: center;

}

nav ul li{
    padding: 1em;
    padding-block: 0.25em;
    margin: 0.25em;
    background-color: whitesmoke;
    list-style-type: none;
    font-family: "Source Serif Pro", serif;
    display: inline-block;
    align-items: center;
    justify-content: center;
    font-weight: 900;
}



</style>

<link rel="icon" type="image/png" href="/images/logo.png"/>
<div class="banner">
<hr>
<nav>
<ul>
<li><a href="/index.html"><b>HOME</b></a></li>
<li><a href="/sites/proyectos.html"><b>PROYECTOS</b></a></li>
<li><a href="/sites/blog.html"><b>BLOG</b></a></li>
<li><a href="/sites/peliculas.html"><b>PELÍCULAS</b></a></li>
<li><a href="/sites/miscelanea.html"><b>MISCELÁNEA</b></a></li>
<!--- <li><a href="/sites/libros.html"><b>LIBROS</b></a></li> --->

</ul>


<!--- <a href="/sites/aboutme.html">Sobre mí</a> --->
</ul>
</nav>
</div>

<div id="outline-container-org40d5ff1" class="outline-2">
<h2 id="un-ingeniero-en-problemas-por-detr-s">RhylooSolutions (por detrás).</h2>
<div class="outline-text-2" id="text-un-ingeniero-en-problemas-por-detr-s">
<p>
Mi sitio web ha tenido muchos cambios, haciendo una cuenta rápida entre 6 y 10  cambios grandes, los archivos de texto o la idea original de lo que quería exponer siempre se han mantenido más o menos constante, la ventaja de trabajar en texto plano; los cambios se han producido principalmente en el <b>"workflow"</b> he pasado por generar un sitio desde la mina, picando con código <code>HTML</code> Y <code>css</code> desde cero, algo que no recomiendo a nadie si no quiere perder las ganas de vivir o al menos de usar el lenguaje de marcado, hasta llegar a frameworks como HUGO y JEKYLL.
</p>

<p>
Me encantaría tener una foto de todos los formatos por los que he pasado&#x2026; una pena que en su momento no pensara en el valor que tendría, si escribía esto, supongo que era porque escribir una entrada del blog no era tan fácil, implicaba copiar el código que había escrito comentarlo, multiplicar por cientos los archivos generados, vamos un autentico coñazo y lo digo yo que soy el escritor&#x2026; por suerte EMACS estaba ahí para solucionar mi vida, algo que detallaré más adelante, aunque me parece que tengo algunas capturas.
</p>

<p>
Estaría bien enumerar esos  métodos usados "por las risas" o por empezar a llevar un control y rescatar algunas fotos que habrá hecho de mi sitio la <a href="https://archive.org/web/">Wayback Machine</a>, una vez más el <b>backup</b> salvándonos el culo.
</p>

<p>
Hay otra "persona" que conoce los cambios que ha sufrido mi sitio, <a href="https://github.com/rhyloo/rhyloo.github.io/network">Github</a>, evidentemente si usas git para control de versiones debería tenerlo todo, pues no, yo creaba un repositorio nuevo con cada cambio, que las ramas deben estar limpias y no mostrar errores, es código e internet deben mantenerse los cambios, en fin, sigamos.
</p>

<p>
Por ahora recuerdo estos:
</p>
<ul class="org-ul">
<li>HTML y CSS puro.</li>
<li>Org Mode (mal)</li>
<li>Wordpress</li>
<li>JEKYLL</li>
<li>HUGO</li>
<li>Org Mode (actual)</li>
</ul>

<p>
Ahora lo idea sería comentar cada uno, adjuntar captura si la tengo y decir porqué Org Mode (mal) y porqué Org Mode otra vez, pero lo dejaré para otro artículo ahora lo que importa es como está hecho este sitio.
</p>
</div>
</div>

<div id="outline-container-orgde85fd9" class="outline-2">
<h2 id="desde-el-lodo-al-xito">Desde el lodo al éxito</h2>
<div class="outline-text-2" id="text-desde-el-lodo-al-xito">
<p>
<b>¿Por qué Org Mode?</b>
Bueno, porque uso EMACS, diría que es broma pero es una realidad usar EMACS y su entorno es lo que mejor funciona, esta entrada de blog servirá como generador de css y como artículo, y los bloques de código fuente que ves aquí se guardan en un archivo .css directamente evitando el molesto copy&amp;paste que tenía que hacer en los otros frameworks, trabajar con el teclado me encanta apenas y tengo que tocar el ratón y bueno poco más, lo que más valoro es el workflow.
</p>

<div class="org-src-container">
<pre class="src src-sh" id="org0580387">tree -a ./../../content -I <span style="font-style: italic;">"*~"</span>
</pre>
</div>

<pre class="example">
./../../content
├── docs
│   └── recipe.pdf
├── header.org
├── images
│   ├── aa.svg
│   ├── banner_picture.jpg
│   ├── contour.svg
│   ├── dot_success.svg
│   ├── filter_chebyshev_low_pass_1.png
│   ├── filter_chebyshev_low_pass_2.png
│   ├── filter_chebyshev_low_pass_3.png
│   ├── fsa.svg
│   ├── github.png
│   ├── logo.png
│   ├── mastermind_game_easy.png
│   ├── mastermind.png
│   ├── matlab-file-exchange.svg
│   ├── real_programmers.png
│   ├── recipe.png
│   ├── TDDS_progress1.png
│   ├── TDDS_wiwt.png
│   └── WIN95.png
├── index.org
├── org-html-themes-personal
│   ├── .#site.org -&gt; rhyloo@rhylap.139473:1671913051
│   └── site.org
├── posts
│   ├── 2021-07-21-seguridad-en-la-piscina.org
│   ├── archive
│   │   ├── 2021-05-19-mi-primer-post.org
│   │   ├── 2021-05-19-seguridad-sobrevalorada.org
│   │   ├── 2021-05-20-colpitts-0---rhyloo-1.org
│   │   ├── 2021-05-24-segundo-post.org
│   │   ├── 31052021_emacs_portable.org_archive
│   │   └── como_escribir_un_blog.org
│   └── drafts
│       └── 31052021_emacs_portable.org
├── proyectos
│   ├── archive
│   │   ├── ControlSymbs.md
│   │   ├── LaTeX_Templates.md
│   │   ├── Mastermind.md
│   │   ├── problema_puntuable_3.org
│   │   ├── TDDS.md
│   │   ├── Telegram_Bot.md
│   │   └── telegram_bot.org
│   ├── controlsymbs.org
│   ├── #filtro_chevyshev.org#
│   ├── filtro_chevyshev.org
│   ├── mastermind.org
│   ├── template_recipes.org
│   └── universibot.org
├── sitemap.org
└── sites
    ├── aboutme.org
    ├── blog.org
    ├── _index.org
    ├── libros.org
    ├── miscelanea.org
    ├── peliculas.org
    └── proyectos.org

9 directories, 52 files
</pre>
</div>
</div>
