WebPage/docs/org-html-themes-personal/site.html

<div id="outline-container-orgca59d29" class="outline-2">
<h2 id="cooked-style">Cooked style</h2>
<div class="outline-text-2" id="text-cooked-style">
</div>

<div id="outline-container-orgbab6915" class="outline-3">
<h3 id="variables">Variables</h3>
<div class="outline-text-3" id="text-variables">
<div class="org-src-container">
<pre class="src src-css"><span style="font-weight: bold;">:root</span> {
    <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">Code </span><span style="font-weight: bold; font-style: italic;">*/</span>
    <span style="font-weight: bold; font-style: italic;">--code-bg</span>: <span style="color: #000000; background-color: #f5ebe1;">#f5ebe1</span>;
    <span style="font-weight: bold; font-style: italic;">--code-lang-bg</span>: <span style="color: #000000; background-color: #90ee90;">lightgreen</span>;
    <span style="font-weight: bold; font-style: italic;">--code-border-color</span>: <span style="color: #000000; background-color: #800080;">purple</span>
    <span style="font-weight: bold; font-style: italic;">--code-height</span>: 125ex;

    <span style="font-weight: bold; font-style: italic;">/*</span><span style="font-weight: bold; font-style: italic;">Body</span><span style="font-weight: bold; font-style: italic;">*/</span>
    <span style="font-weight: bold; font-style: italic;">--body-color</span>: <span style="color: #ffffff; background-color: #000000;">black</span>;
    <span style="font-weight: bold; font-style: italic;">--body-bg</span>: <span style="color: #000000; background-color: #f5f5f5;">whitesmoke</span>;
    <span style="font-weight: bold; font-style: italic;">--landscape-body-width</span>: 810px;
    <span style="font-weight: bold; font-style: italic;">--landscape-sidebar-width</span>: 280px;

    <span style="font-weight: bold; font-style: italic;">/*</span><span style="font-weight: bold; font-style: italic;">Title</span><span style="font-weight: bold; font-style: italic;">*/</span>
    <span style="font-weight: bold; font-style: italic;">--title-size-font</span>: 250%;
    <span style="font-weight: bold; font-style: italic;">--title-color</span>:<span style="color: #ffffff; background-color: #000000;">black</span>;
    <span style="font-weight: bold; font-style: italic;">--title-font-weight</span>: 600;

    <span style="font-weight: bold; font-style: italic;">/*</span><span style="font-weight: bold; font-style: italic;">TOC</span><span style="font-weight: bold; font-style: italic;">*/</span>
    <span style="font-weight: bold; font-style: italic;">--toc-bg</span>: <span style="color: #000000; background-color: #ffffff;">white</span>;

    <span style="font-weight: bold;">font-family</span>: <span style="font-style: italic;">"Source Serif Pro"</span>, serif;
    <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">otherwise scrollbar impacts the content </span><span style="font-weight: bold; font-style: italic;">*/</span>
    <span style="font-weight: bold;">overflow-y</span>: scroll;
    <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">From copy  </span><span style="font-weight: bold; font-style: italic;">*/</span>
    <span style="font-weight: bold; font-style: italic;">--link-color</span>: <span style="color: #ffffff; background-color: #0000EE;">#0000EE</span>;
    <span style="font-weight: bold; font-style: italic;">--visited-link-color</span>:  <span style="color: #ffffff; background-color: #0000ee;">#0000ee</span>;
    <span style="font-weight: bold; font-style: italic;">--width</span>: 60rem; <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">todo rename to main-width?? </span><span style="font-weight: bold; font-style: italic;">*/</span>
    <span style="font-weight: bold; font-style: italic;">--aside-width</span>: 20rem;
}
</pre>
</div>
</div>
</div>
