WebPage/docs/org-html-themes-personal/site.html

<div id="outline-container-orgcc2b944" class="outline-3">
<h3 id="orgcc2b944">Core</h3>
<div class="outline-text-3" id="text-orgcc2b944">
<div class="org-src-container">
<pre class="src src-css"><span style="font-weight: bold;">html </span>{
  <span style="font-weight: bold;">font-family</span>: <span style="font-style: italic;">"Source Serif Pro"</span>, serif;
  <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">otherwise scrollbar impacts the content </span><span style="font-weight: bold; font-style: italic;">*/</span>
  <span style="font-weight: bold;">overflow-y</span>: scroll;
}

<span style="font-weight: bold;">#settings </span>{
  <span style="font-weight: bold;">z-index</span>: -1;
}

<span style="font-weight: bold;">#bottomfooter </span>{
  <span style="font-weight: bold;">border-top</span>: 0.1rem solid;
  <span style="font-weight: bold;">padding-top</span>: 1em;
  <span style="font-weight: bold;">font-size</span>: 0.75em;

  <span style="font-weight: bold;">display</span>: flex;
  <span style="font-weight: bold;">flex-wrap</span>: wrap;
  <span style="font-weight: bold;">column-gap</span>: 0.5em;
}

<span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">now, post-specific stuff </span><span style="font-weight: bold; font-style: italic;">*/</span>

<span style="font-weight: bold;">time </span>{
    <span style="font-weight: bold;">font-family</span>: <span style="font-style: italic;">"Lucida Console"</span>, Monaco, monospace;
}

<span style="font-weight: bold;">.post-tag + .post-tag </span>{
    <span style="font-weight: bold;">margin-left</span>: 0.5em;
}

<span style="font-weight: bold;">.post-tag </span>{
  <span style="font-weight: bold;">font-size</span>: 0.95em;
  <span style="font-weight: bold;">font-family</span>: <span style="font-style: italic;">"Lucida Console"</span>, Monaco, monospace;

  <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">https://stackoverflow.com/a/12362315/706389</span>
<span style="font-weight: bold; font-style: italic;">     somewhat hacky way to prevent breaking tags on hyphens...</span>
<span style="font-weight: bold; font-style: italic;">   </span><span style="font-weight: bold; font-style: italic;">*/</span>
  <span style="font-weight: bold;">white-space</span>: nowrap;
}

<span style="font-weight: bold;">.tag-active </span>{
  <span style="font-weight: bold;">color</span>: <span style="color: #ffffff; background-color: #a51;">#a51</span>;
  <span style="font-weight: bold;">font-weight</span>: bold;
}

<span style="font-weight: bold;">.tag-inactive </span>{
  <span style="font-weight: bold;">color</span>: <span style="color: #ffffff; background-color: #000000;">black</span>;
}

<span style="font-weight: bold;">#post-title h1 </span>{
  <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">default margin is too large </span><span style="font-weight: bold; font-style: italic;">*/</span>
  <span style="font-weight: bold;">margin-bottom</span>: 0em;
}

<span style="font-weight: bold;">#post-title .summary </span>{
  <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">???  </span><span style="font-weight: bold; font-style: italic;">*/</span>
  <span style="font-weight: bold; font-style: italic;">-webkit-margin-before</span>:0em;
  <span style="font-weight: bold; font-style: italic;">-webkit-margin-after</span>:0em;

  <span style="font-weight: bold;">color</span>: <span style="color: #000000; background-color: #a9a9a9;">#a9a9a9</span>;
  <span style="font-weight: bold;">font-size</span>: 1.5em;
}







<span style="font-weight: bold;">article aside.sidenote </span>{
  <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">todo highlight sidenotes maybe? </span><span style="font-weight: bold; font-style: italic;">*/</span>
  <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">to match with corresponding &lt;p&gt; </span><span style="font-weight: bold; font-style: italic;">*/</span>
  <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">TODO is this really necessary?? </span><span style="font-weight: bold; font-style: italic;">*/</span>
  <span style="font-weight: bold;">display</span> : var(<span style="font-weight: bold; font-style: italic;">--sidenote-display</span>);

  <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">makes it work in conjucion with position: relative in article </span><span style="font-weight: bold; font-style: italic;">*/</span>
  <span style="font-weight: bold;">position</span>: var(<span style="font-weight: bold; font-style: italic;">--sidenote-position</span>);
  <span style="font-weight: bold;">left</span>    : var(<span style="font-weight: bold; font-style: italic;">--sidenote-left</span>);
  <span style="font-weight: bold;">width</span>   : var(<span style="font-weight: bold; font-style: italic;">--sidenote-width</span>);

  <span style="font-weight: bold;">padding-left</span> : 2em; <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">for horizontal padding between text and note </span><span style="font-weight: bold; font-style: italic;">*/</span>
  <span style="font-weight: bold;">padding-right</span>: 1em; <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">so it's not too close to the screen edge </span><span style="font-weight: bold; font-style: italic;">*/</span>
  <span style="font-weight: bold;">box-sizing</span>: border-box; <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">without it doesn't wrap around?? </span><span style="font-weight: bold; font-style: italic;">*/</span>

  <span style="font-weight: bold;">font-size</span>: 0.8em;
  <span style="font-weight: bold;">color</span>: <span style="color: #000000; background-color: #808080;">gray</span>;
}

<span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">TODO not sure if article should contain footer and comments?? </span><span style="font-weight: bold; font-style: italic;">*/</span>

<span style="font-weight: bold;">a.headerlink </span>{
    <span style="font-weight: bold;">text-decoration</span>: none;
    <span style="font-weight: bold;">color</span>: <span style="color: #000000; background-color: #d3d3d3;">lightgrey</span>;
}
<span style="font-weight: bold;">h1</span>:hover &gt; a.headerlink,
<span style="font-weight: bold;">h2</span>:hover &gt; a.headerlink,
<span style="font-weight: bold;">h3</span>:hover &gt; a.headerlink,
<span style="font-weight: bold;">h4</span>:hover &gt; a.headerlink,
<span style="font-weight: bold;">h5</span>:hover &gt; a.headerlink,
<span style="font-weight: bold;">h6:hover &gt; a.headerlink </span>{
    <span style="font-weight: bold;">color</span>: <span style="color: #ffffff; background-color: #c60f0f;">#c60f0f</span>
}
<span style="font-weight: bold; font-style: italic;">/*</span>
<span style="font-weight: bold; font-style: italic;">a.headerlink:hover {</span>
<span style="font-weight: bold; font-style: italic;">    background-color: #c60f0f;</span>
<span style="font-weight: bold; font-style: italic;">    color: white;</span>
<span style="font-weight: bold; font-style: italic;">}</span>
<span style="font-weight: bold; font-style: italic;">*/</span>
<span style="font-weight: bold; font-style: italic;">/* */</span>

<span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">highlight inline code produced by org-mode </span><span style="font-weight: bold; font-style: italic;">*/</span>
<span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">TODO support for ipynb as well? </span><span style="font-weight: bold; font-style: italic;">*/</span>
<span style="font-weight: bold;">code.inline </span>{
    <span style="font-weight: bold;">color</span>: <span style="color: #ffffff; background-color: #008000;">green</span>;
}
<span style="font-weight: bold;">a code.inline </span>{
    <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">TODO not sure about this one... </span><span style="font-weight: bold; font-style: italic;">*/</span>
    <span style="font-weight: bold;">text-decoration</span>: underline;
}
<span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">end </span><span style="font-weight: bold; font-style: italic;">*/</span>


<span style="font-weight: bold;">details summary </span>{
    <span style="font-weight: bold;">cursor</span>: pointer;
}


<span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">compile-org sets these  </span><span style="font-weight: bold; font-style: italic;">*/</span>
<span style="font-weight: bold;">a.link-down:after </span>{
    <span style="font-weight: bold;">content</span>: <span style="font-style: italic;">"&#10549;"</span>;
}

<span style="font-weight: bold;">a.link-up:after </span>{
    <span style="font-weight: bold;">content</span>: <span style="font-style: italic;">"&#10548;"</span>;
}
<span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">end </span><span style="font-weight: bold; font-style: italic;">*/</span>


<span style="font-weight: bold;">#post-footer time </span>{
  <span style="font-weight: bold;">color</span>: <span style="color: #ffffff; background-color: #555;">#555</span>;
}

<span style="font-weight: bold;">#isso-root .avatar </span>{
  <span style="font-weight: bold;">display</span>: none;
}

<span style="font-weight: bold;">.debug-usage </span>{
    <span style="font-weight: bold;">animation</span>:debug 0.8s infinite;
}

<span style="font-weight: bold;">@keyframes</span> debug{
    <span style="font-weight: bold;">0%</span>{     <span style="font-weight: bold;">background</span>: <span style="color: #ffffff; background-color: #000000;">black</span>; <span style="font-weight: bold;">color</span>: <span style="color: #ffffff; background-color: #f00;">#f00</span>;    }
    <span style="font-weight: bold;">49%</span>{    <span style="font-weight: bold;">background</span>: <span style="color: #ffffff; background-color: #000000;">black</span>; <span style="font-weight: bold;">color</span>: transparent; }
    <span style="font-weight: bold;">50%</span>{    <span style="font-weight: bold;">background</span>: <span style="color: #ffffff; background-color: #000000;">black</span>; <span style="font-weight: bold;">color</span>: transparent; }
    <span style="font-weight: bold;">99%</span>{    <span style="font-weight: bold;">background</span>: <span style="color: #ffffff; background-color: #000000;">black</span>; <span style="font-weight: bold;">color</span>: transparent;  }
    <span style="font-weight: bold;">100%</span>{   <span style="font-weight: bold;">background</span>: <span style="color: #ffffff; background-color: #000000;">black</span>; <span style="font-weight: bold;">color</span>: <span style="color: #ffffff; background-color: #f00;">#f00</span>;    }
}

</pre>
</div>
</div>
</div>
