drafts/content/org-html-themes-personal/site.org
** Responsive
#+begin_src css :results none :exports code
/* 80 = --width + --aside-width */
@media (min-width: 80rem) {
    body {
        width: var(--width);
        /* auto margin centers the content. not sure if it's the right way to do it... */
        margin-left:  auto;
        margin-right: auto;
        text-align: justify;
    }

    a.headerlink {
        margin-left: -1em;
    }
}

/* 80 = --width + --aside-width */
@media (min-width: 80rem) {
  /* when wide enough, display as a side note */
  article {
    --sidenote-display  : inline;

    /* if wide enough, display at a fixed position on the right */
    position: relative;
    --sidenote-position : absolute;
    --sidenote-left     : var(--width);

    /* set width, otherwise they wrap at the word boundary */
    --sidenote-width    : var(--aside-width);
  }

  .before-aside {
    /* hacky way of forcing aside to display on the same line....
     ,* without it, it displays on the same line as the last
     ,* (can see on multiline paragraphs). probably can be fixed in a better way?
     ,* e.g. can reorder aside and the preceding element.. but this is a bit misleading then
     ,*/
    display: inline-block;
  }
  li .before-aside {
    /* for li, that breaks the list marker alignment...  I guess that's a relatively small price to pay for now... */
    display: initial;
  }
}

@media (max-width: 80rem) {
  article {
    --sidenote-display  : block;
  }
}
#+end_src
** Links
#+begin_src css :results none :exports code
a:link,a:visited{
  color: #2a5db0;
    /* default is underline... dunno, feels pretty distracting */
  text-decoration: none;
}
#+end_src

** Titulos
*** headings
#+begin_src css :results none :exports code
h1,
h2,
h3 {
 /* font-family:"Open Sans","Deja Vu Sans", Georgia, sans; */
 font-weight:600;
 text-decoration:none;
}

h1 {
    font-size: 2rem;
    text-align: center;
}

h2 {
    font-size: 1.7rem;
 text-align: center;
}

h3 {
 /* text-align: center; */
  font-size: 1.4rem;
}

h4 {
  font-size: 1rem;
}

h1 a,
h2 a,
h3 a {
 text-decoration:none;
}

b,
strong {
 font-weight:700;
}

#+end_src
*** subheadings
#+begin_src css :results none :exports code
.subheading {
text-align: center;
color: gray;
  margin-top: -20px;
  margin-bottom: 20px;
}
#+end_src
** Images
#+begin_src css :results none :exports code
figure {
text-align: center;
}
img {
    max-width: 100%;
    max-height: 100%;
}
#+end_src
** Tags
#+begin_src css :results none :exports code
span.done {
    display: flex;
    justify-content: space-between;
}

span.todo {
    display: flex;
    justify-content: space-between;
}
#+end_src

** Movies
#+begin_src css :results none :exports code
.timestamp {
    color: blue;
}
.timestamp-wrapper {
    font-size: 0.75em;
    font-family: "Lucida Console", Monaco, monospace;
}
#outline-container-orgf518ae7 div.outline-text-3{
display: grid;
grid-template-columns: 28em auto;
grid-template-rows: auto auto;
}

#outline-container-orgf518ae7 div.outline-text-3* p:first-child{
  grid-column: 1 / 1;
}

.movies-done{
 background-color: whitesmoke;
}
.movies-done ul{
  list-style-type: none;
  display: inline;
  /* justify-content: justify; */

}

.movies-done ul li{
    margin: 0.2em;
    list-style-type: none;
    font-family: "Source Serif Pro", serif;
    display: inline-block;
    /* align-items: justify; */
    /* justify-content: justify; */
    font-weight: 850;
}
#+end_src

