WebPage/docs/org-html-themes-personal/site.html

<div id="outline-container-org33075c2" class="outline-3">
<h3 id="org33075c2">Responsive</h3>
<div class="outline-text-3" id="text-org33075c2">
<div class="org-src-container">
<pre class="src src-css"><span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">80 = --width + --aside-width </span><span style="font-weight: bold; font-style: italic;">*/</span>
<span style="font-weight: bold;">@media</span> (min-width: 80rem) {
    <span style="font-weight: bold;">body </span>{
        <span style="font-weight: bold;">width</span>: var(<span style="font-weight: bold; font-style: italic;">--width</span>);
        <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">auto margin centers the content. not sure if it's the right way to do it... </span><span style="font-weight: bold; font-style: italic;">*/</span>
        <span style="font-weight: bold;">margin-left</span>:  auto;
        <span style="font-weight: bold;">margin-right</span>: auto;
        <span style="font-weight: bold;">text-align</span>: justify;
    }

    <span style="font-weight: bold;">a.headerlink </span>{
        <span style="font-weight: bold;">margin-left</span>: -1em;
    }
}

<span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">80 = --width + --aside-width </span><span style="font-weight: bold; font-style: italic;">*/</span>
<span style="font-weight: bold;">@media</span> (min-width: 80rem) {
  <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">when wide enough, display as a side note </span><span style="font-weight: bold; font-style: italic;">*/</span>
  <span style="font-weight: bold;">article </span>{
    <span style="font-weight: bold; font-style: italic;">--sidenote-display</span>  : inline;

    <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">if wide enough, display at a fixed position on the right </span><span style="font-weight: bold; font-style: italic;">*/</span>
    <span style="font-weight: bold;">position</span>: relative;
    <span style="font-weight: bold; font-style: italic;">--sidenote-position</span> : absolute;
    <span style="font-weight: bold; font-style: italic;">--sidenote-left</span>     : var(<span style="font-weight: bold; font-style: italic;">--width</span>);

    <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">set width, otherwise they wrap at the word boundary </span><span style="font-weight: bold; font-style: italic;">*/</span>
    <span style="font-weight: bold; font-style: italic;">--sidenote-width</span>    : var(<span style="font-weight: bold; font-style: italic;">--aside-width</span>);
  }

  <span style="font-weight: bold;">.before-aside </span>{
    <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">hacky way of forcing aside to display on the same line....</span>
<span style="font-weight: bold; font-style: italic;">     * without it, it displays on the same line as the last</span>
<span style="font-weight: bold; font-style: italic;">     * (can see on multiline paragraphs). probably can be fixed in a better way?</span>
<span style="font-weight: bold; font-style: italic;">     * e.g. can reorder aside and the preceding element.. but this is a bit misleading then</span>
<span style="font-weight: bold; font-style: italic;">     </span><span style="font-weight: bold; font-style: italic;">*/</span>
    <span style="font-weight: bold;">display</span>: inline-block;
  }
  <span style="font-weight: bold;">li .before-aside </span>{
    <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">for li, that breaks the list marker alignment...  I guess that's a relatively small price to pay for now... </span><span style="font-weight: bold; font-style: italic;">*/</span>
    <span style="font-weight: bold;">display</span>: initial;
  }
}

<span style="font-weight: bold;">@media</span> (max-width: 80rem) {
  <span style="font-weight: bold;">article </span>{
    <span style="font-weight: bold; font-style: italic;">--sidenote-display</span>  : block;
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfe044e8" class="outline-3">
<h3 id="orgfe044e8">Links</h3>
<div class="outline-text-3" id="text-orgfe044e8">
<div class="org-src-container">
<pre class="src src-css"><span style="font-weight: bold;">a:link,a:visited</span>{
  <span style="font-weight: bold;">color</span>: <span style="color: #ffffff; background-color: #2a5db0;">#2a5db0</span>;
    <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">default is underline... dunno, feels pretty distracting </span><span style="font-weight: bold; font-style: italic;">*/</span>
  <span style="font-weight: bold;">text-decoration</span>: none;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org4e8c939" class="outline-3">
<h3 id="org4e8c939">Titulos</h3>
<div class="outline-text-3" id="text-org4e8c939">
</div>
<div id="outline-container-orgc839ec3" class="outline-4">
<h4 id="orgc839ec3">headings</h4>
<div class="outline-text-4" id="text-orgc839ec3">
<div class="org-src-container">
<pre class="src src-css"><span style="font-weight: bold;">h1,</span>
<span style="font-weight: bold;">h2,</span>
<span style="font-weight: bold;">h3 </span>{
 <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">font-family:"Open Sans","Deja Vu Sans", Georgia, sans; </span><span style="font-weight: bold; font-style: italic;">*/</span>
 <span style="font-weight: bold;">font-weight</span>:600;
 <span style="font-weight: bold;">text-decoration</span>:none;
}

<span style="font-weight: bold;">h1 </span>{
    <span style="font-weight: bold;">font-size</span>: 2rem;
    <span style="font-weight: bold;">text-align</span>: center;
}

<span style="font-weight: bold;">h2 </span>{
    <span style="font-weight: bold;">font-size</span>: 1.7rem;
 <span style="font-weight: bold;">text-align</span>: center;
}

<span style="font-weight: bold;">h3 </span>{
 <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">text-align: center; </span><span style="font-weight: bold; font-style: italic;">*/</span>
  <span style="font-weight: bold;">font-size</span>: 1.4rem;
}

<span style="font-weight: bold;">h4 </span>{
  <span style="font-weight: bold;">font-size</span>: 1rem;
}

<span style="font-weight: bold;">h1 a,</span>
<span style="font-weight: bold;">h2 a,</span>
<span style="font-weight: bold;">h3 a </span>{
 <span style="font-weight: bold;">text-decoration</span>:none;
}

<span style="font-weight: bold;">b,</span>
<span style="font-weight: bold;">strong </span>{
 <span style="font-weight: bold;">font-weight</span>:700;
}

</pre>
</div>
</div>
</div>
<div id="outline-container-orgbdd9a85" class="outline-4">
<h4 id="orgbdd9a85">subheadings</h4>
<div class="outline-text-4" id="text-orgbdd9a85">
<div class="org-src-container">
<pre class="src src-css"><span style="font-weight: bold;">.subheading </span>{
<span style="font-weight: bold;">text-align</span>: center;
<span style="font-weight: bold;">color</span>: <span style="color: #000000; background-color: #808080;">gray</span>;
  <span style="font-weight: bold;">margin-top</span>: -20px;
  <span style="font-weight: bold;">margin-bottom</span>: 20px;
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgebb49d4" class="outline-3">
<h3 id="orgebb49d4">Images</h3>
<div class="outline-text-3" id="text-orgebb49d4">
<div class="org-src-container">
<pre class="src src-css"><span style="font-weight: bold;">figure </span>{
<span style="font-weight: bold;">text-align</span>: center;
}
<span style="font-weight: bold;">img </span>{
    <span style="font-weight: bold;">max-width</span>: 100%;
    <span style="font-weight: bold;">max-height</span>: 100%;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfcc94a5" class="outline-3">
<h3 id="orgfcc94a5">Tags</h3>
<div class="outline-text-3" id="text-orgfcc94a5">
<div class="org-src-container">
<pre class="src src-css"><span style="font-weight: bold;">span.done </span>{
    <span style="font-weight: bold;">display</span>: flex;
    <span style="font-weight: bold;">justify-content</span>: space-between;
}

<span style="font-weight: bold;">span.todo </span>{
    <span style="font-weight: bold;">display</span>: flex;
    <span style="font-weight: bold;">justify-content</span>: space-between;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orged71131" class="outline-3">
<h3 id="orged71131">Movies</h3>
<div class="outline-text-3" id="text-orged71131">
<div class="org-src-container">
<pre class="src src-css"><span style="font-weight: bold;">.timestamp </span>{
    <span style="font-weight: bold;">color</span>: <span style="color: #ffffff; background-color: #0000ff;">blue</span>;
}
<span style="font-weight: bold;">.timestamp-wrapper </span>{
    <span style="font-weight: bold;">font-size</span>: 0.75em;
    <span style="font-weight: bold;">font-family</span>: <span style="font-style: italic;">"Lucida Console"</span>, Monaco, monospace;
}
<span style="font-weight: bold;">#outline-container-orgf518ae7 div.outline-text-3</span>{
<span style="font-weight: bold;">display</span>: grid;
<span style="font-weight: bold;">grid-template-columns</span>: 28em auto;
<span style="font-weight: bold;">grid-template-rows</span>: auto auto;
}

<span style="font-weight: bold;">#outline-container-orgf518ae7 div.outline-text-3* p:first-child</span>{
  <span style="font-weight: bold;">grid-column</span>: 1 / 1;
}

<span style="font-weight: bold;">.movies-done</span>{
 <span style="font-weight: bold;">background-color</span>: <span style="color: #000000; background-color: #f5f5f5;">whitesmoke</span>;
}
<span style="font-weight: bold;">.movies-done ul</span>{
  <span style="font-weight: bold;">list-style-type</span>: none;
  <span style="font-weight: bold;">display</span>: inline;
  <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">justify-content: justify; </span><span style="font-weight: bold; font-style: italic;">*/</span>

}

<span style="font-weight: bold;">.movies-done ul li</span>{
    <span style="font-weight: bold;">margin</span>: 0.2em;
    <span style="font-weight: bold;">list-style-type</span>: none;
    <span style="font-weight: bold;">font-family</span>: <span style="font-style: italic;">"Source Serif Pro"</span>, serif;
    <span style="font-weight: bold;">display</span>: inline-block;
    <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">align-items: justify; </span><span style="font-weight: bold; font-style: italic;">*/</span>
    <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">justify-content: justify; </span><span style="font-weight: bold; font-style: italic;">*/</span>
    <span style="font-weight: bold;">font-weight</span>: 850;
}
</pre>
</div>
</div>
</div>
