drafts/content/org-html-themes-personal/site.org
** Enlaces de interes
#+begin_src css :results none :exports code
.enlaces-de-interes{
    background-color: #ced;
}
.enlaces-de-interes ul{
  list-style-type: none;
  display: inline;
  /* justify-content: justify; */

}

.enlaces-de-interes ul li{
    margin: 0.2em;
    list-style-type: none;
    font-family: "Source Serif Pro", serif;
    display: inline-block;
    /* align-items: justify; */
    /* justify-content: justify; */
    font-weight: 350;
}
#+end_src

** Enlaces de Wikipedia
#+begin_src css :results none :exports code
.enlaces-de-wikipedia{
    background-color: #ffe3003d;
}
.enlaces-de-wikipedia ul{
  list-style-type: none;
  display: inline;
  /* justify-content: justify; */

}

.enlaces-de-wikipedia ul li{
    margin: 0.2em;
    list-style-type: none;
    font-family: "Source Serif Pro", serif;
    display: inline-block;
    /* align-items: justify; */
    /* justify-content: justify; */
    font-weight: 350;
}
#+end_src

** Tables
#+begin_src css :results none :exports code
td.org-left{
text-align: center;
}
#+end_src


** COMMENT Nav
:PROPERTIES:
:CUSTOM_ID: nav
:END:
#+begin_src css :results none :exports code
.banner nav {
 font-size:115%;
 font-family:"Open Sans","Deja Vu Sans", Georgia, sans;
 font-weight:600;
 padding: 15px;
}
.banner p {
 word-spacing:.5em;
 margin:0;
 text-align: center;
}

.banner nav a {
 height:30px;
 text-decoration:none;
}
.banner hr {
 width: var(--landscape-body-width);
 text-align:left;
 margin-left:0;
margin-bottom:0;
margin-top:0;
}
#+end_src
** COMMENT Body
:PROPERTIES:
:CUSTOM_ID: body
:END:
#+begin_src css :results none :exports code
  /* This style sheet configures the basic style of Note */

  /* @import url("../default-style.css"); */

  .title {
  color: var(--title-color);
  font-family:"Open Sans","Deja Vu Sans", Georgia, sans;
  font-size: var(--title-size-font);
  font-weight: var(--title-font-weight);
  text-decoration:none;
  }

  body {
      font-family: 'MS Sans Serif', Geneva, sans-serif;;
      font-size: 12pt;
      min-width: 400px;
      max-width: 1000px;
      margin: 0 auto;
      text-align: justify;
      margin: auto;
      width: 70%;
      color: var(--body-color);
      background-color: var(--body-bg);
      --content-margin-left:
      calc((100vw - var(--landscape-body-width)
      - var(--landscape-sidebar-width)) / 3);
      margin-left: calc(var(--content-margin-left) +
      var(--landscape-sidebar-width));
      width: var(--landscape-body-width);
      }
#+end_src
** COMMENT Table of contents
:PROPERTIES:
:CUSTOM_ID: table-of-contents
:END:
#+begin_src css :results none :exports code
  /* Landscape */
  /* Floating TOC */
  #table-of-contents {
  border-top: 1px dotted black;
  border-left: 1px dotted black;
  border-right: 1px dotted black;
  border-bottom: 1px dotted black;
  /* padding: 0.8em; */
  background-color: var(--toc-bg);
  height: auto;
   /* overflow: auto; */
          padding-inline-start: 0px;
          text-align: left;
          font-size: 14px;
          /* bottom: 0; */
          position: fixed;
          overflow-y: scroll;
          overflow-x: wrap;
          top: 145px;
          left: 2.5em;
          width: 25em;
          /* Hide scrollbar in Firefox */
          scrollbar-width: none;
          /* Hide scrollbar in Edge */
          -ms-overflow-style: none;
      }
      /* Hide scrollbar in Safari and Chrome */
      #table-of-contents::-webkit-scrollbar {
          display: none;
      }

  .wrap-figure-right{
      float: right;
      margin: 5px;
      margin-top: 0px;
      width: 18%;
      position: relative;
      top: -20%;
  }

  .rssbox {
      padding: 0.3em;
      margin: 0.2em;
      margin-bottom: 0.5em;
      display: inline-block;
      float: right
  }

  img.rssimg {
      height: 1em;
  }

  .flattrbox {
      border: 1px solid black;
      padding: 0.3em;
      display: inline-block;
      float: right;
  }

  .outline-2 {
      border-top: 1px dotted black;
      border-left: 1px dotted black;
      border-right: 1px dotted black;
      padding: 0.8em;
      background-color: white;
      height: 100%;
      overflow: auto;
  }

  #postamble {
      border-top: 3px solid black;
      font-size: small;
      float: none;
  }



  #content p:nth-child(1) {
      border: 1 px dotted black;
  }

  div.figure p {
      font-weight: bold;
      padding: 0.0em;
      margin: 0.0em;
  }


  .gmap {
      border: 1px solid black;
      padding: 1em;
      margin: 1em;
      float: right;
  }

  div.caption {
      font-size: 13pt;
      font-weight: 500;
  }


  /* a { */
  /*     color: inherit; */
  /*     background-color: inherit; */
  /*     font: inherit; */
  /*     text-decoration: inherit; */
  /* } */
  /* a:hover { */
  /*     text-decoration: underline; */
  /* } */

#+end_src

** COMMENT Source Code
:PROPERTIES:
:CUSTOM_ID: source-code
:END:

#+begin_src css :results none :exports code
code {
  font-style: oblique;
  }

p.verse { margin-left: 3%; }
pre {
  border: 1px solid black;
  box-shadow: 3px 3px 8px #000;
  position: relative;
  font-family: monospace;
  overflow: auto;
  margin: 1.2em;
  font-family: DejaVu, Lucida Console, monospace;
  font-size: 10pt;
}

pre.src {

  overflow-x: auto;
  overflow-y: auto;
 line-height: 2.5ex;
  max-height: 75ex;
  outline: 5px solid var(--code-border-color);
  background-color: var(--code-bg);
}

pre.src:before {
  display: none;
  overflow: hidden;
  top: 2%;
  background-color: var(--code-lang-bg);
  padding: 3px;
  border: 1px solid black;
}

pre.src:hover:before {
    display: inline;
    position: absolute;
    width: max-content;
    height:max-content;
}
#+end_src

** COMMENT Links
:PROPERTIES:
:CUSTOM_ID: links
:END:
#+begin_src css :results none :exports code
  a:link,a:visited{
  color: #2a5db0;
  text-decoration: none;
  }

   /*    #table-of-contents, a:link{ */
   /*          /\* color: #8784c8; *\/ */
   /*          color: purple; */
   /*          text-decoration: none; */
   /*      } */

   /*  #table-of-contents, a:visited { */
   /*          /\* color: #544fb0; *\/ */
   /*          color: blue; */
   /*      } */
   /* a:visited, a:link >        button{ */
   /*        color:green; */
   /*         text-decoration: none; */
   /*      } */
#+end_src
** COMMENT Buttons
:PROPERTIES:
:CUSTOM_ID: buttons
:END:
#+begin_src css :results none :exports code

  button:hover {
    color: red;
    transition: 0.01s;
    background-color: white;
  }

  button {
  background: none;
  border: 2px solid yellow;
  font: inherit;
  line-height: 1;
  margin: 0.5em;
  padding: 1em 2em;
  }
.buttons{
text-align: center;
}                               /**/
#+end_src
* Referencias
:PROPERTIES:
:CUSTOM_ID: referencias
:END:

# https://es.wikipedia.org/wiki/Ley_de_Poe
Para desarrollar el css, javascript y en general la estructura de mi sitio he seguido como referencia los siguientes blogs:

- [[https://orgmode.org][Sitio Oficial Org Mode]]
- [[https://thibaultmarin.github.io/blog/posts/2016-11-13-Personal_website_in_org.html#orgace8e3d][Thibaultmarin]]
- [[https://www.brautaset.org/articles/2017/blogging-with-org-mode.html][Brautaset]]
- [[https://archive.casouri.cat/note/2018/blog-with-only-org-mode/index.html#CSS][Casouri]]
- [[https://thenybble.de/projects/orgsite.html][Thenybble]]
- [[https://ogbe.net/][Ogbe]]
- [[https://beepb00p.xyz/][Beepb00p]]

* description-post                                                 :noexport:
:PROPERTIES:
:CUSTOM_ID: description-post
:END:
Mi sitio web ha tenido muchos cambios, haciendo una cuenta rápida entre 6 y 10  cambios grandes, los archivos de texto o la idea original de lo que quería exponer siempre se han mantenido más o menos constante, la ventaja de trabajar en texto plano; los cambios se han producido principalmente en el *"workflow"* he pasado por generar un sitio desde la mina, picando con código ~HTML~ Y ~css~ desde cero, algo que no recomiendo a nadie si no quiere perder las ganas de vivir o al menos de usar el lenguaje de marcado, hasta llegar a frameworks como HUGO y JEKYLL.

# Local Variables:
# eval: (add-hook 'after-save-hook 'org-babel-tangle)
# End:
