WebPage/docs/org-html-themes-personal/site.html

<div id="outline-container-orgbe97510" class="outline-3">
<h3 id="orgbe97510">Enlaces de interes</h3>
<div class="outline-text-3" id="text-orgbe97510">
<div class="org-src-container">
<pre class="src src-css"><span style="font-weight: bold;">.enlaces-de-interes</span>{
    <span style="font-weight: bold;">background-color</span>: <span style="color: #000000; background-color: #ced;">#ced</span>;
}
<span style="font-weight: bold;">.enlaces-de-interes ul</span>{
  <span style="font-weight: bold;">list-style-type</span>: none;
  <span style="font-weight: bold;">display</span>: inline;
  <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">justify-content: justify; </span><span style="font-weight: bold; font-style: italic;">*/</span>

}

<span style="font-weight: bold;">.enlaces-de-interes ul li</span>{
    <span style="font-weight: bold;">margin</span>: 0.2em;
    <span style="font-weight: bold;">list-style-type</span>: none;
    <span style="font-weight: bold;">font-family</span>: <span style="font-style: italic;">"Source Serif Pro"</span>, serif;
    <span style="font-weight: bold;">display</span>: inline-block;
    <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">align-items: justify; </span><span style="font-weight: bold; font-style: italic;">*/</span>
    <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">justify-content: justify; </span><span style="font-weight: bold; font-style: italic;">*/</span>
    <span style="font-weight: bold;">font-weight</span>: 350;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org68d4f42" class="outline-3">
<h3 id="org68d4f42">Enlaces de Wikipedia</h3>
<div class="outline-text-3" id="text-org68d4f42">
<div class="org-src-container">
<pre class="src src-css"><span style="font-weight: bold;">.enlaces-de-wikipedia</span>{
    <span style="font-weight: bold;">background-color</span>: <span style="color: #000000; background-color: #ffe300;">#ffe3003d</span>;
}
<span style="font-weight: bold;">.enlaces-de-wikipedia ul</span>{
  <span style="font-weight: bold;">list-style-type</span>: none;
  <span style="font-weight: bold;">display</span>: inline;
  <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">justify-content: justify; </span><span style="font-weight: bold; font-style: italic;">*/</span>

}

<span style="font-weight: bold;">.enlaces-de-wikipedia ul li</span>{
    <span style="font-weight: bold;">margin</span>: 0.2em;
    <span style="font-weight: bold;">list-style-type</span>: none;
    <span style="font-weight: bold;">font-family</span>: <span style="font-style: italic;">"Source Serif Pro"</span>, serif;
    <span style="font-weight: bold;">display</span>: inline-block;
    <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">align-items: justify; </span><span style="font-weight: bold; font-style: italic;">*/</span>
    <span style="font-weight: bold; font-style: italic;">/* </span><span style="font-weight: bold; font-style: italic;">justify-content: justify; </span><span style="font-weight: bold; font-style: italic;">*/</span>
    <span style="font-weight: bold;">font-weight</span>: 350;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org40fd7f4" class="outline-3">
<h3 id="org40fd7f4">Tables</h3>
<div class="outline-text-3" id="text-org40fd7f4">
<div class="org-src-container">
<pre class="src src-css"><span style="font-weight: bold;">td.org-left</span>{
<span style="font-weight: bold;">text-align</span>: center;
}
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org285de2e" class="outline-2">
<h2 id="referencias">Referencias</h2>
<div class="outline-text-2" id="text-referencias">
<p>
Para desarrollar el css, javascript y en general la estructura de mi sitio he seguido como referencia los siguientes blogs:
</p>

<ul class="org-ul">
<li><a href="https://orgmode.org">Sitio Oficial Org Mode</a></li>
<li><a href="https://thibaultmarin.github.io/blog/posts/2016-11-13-Personal_website_in_org.html#orgace8e3d">Thibaultmarin</a></li>
<li><a href="https://www.brautaset.org/articles/2017/blogging-with-org-mode.html">Brautaset</a></li>
<li><a href="https://archive.casouri.cat/note/2018/blog-with-only-org-mode/index.html#CSS">Casouri</a></li>
<li><a href="https://thenybble.de/projects/orgsite.html">Thenybble</a></li>
<li><a href="https://ogbe.net/">Ogbe</a></li>
<li><a href="https://beepb00p.xyz/">Beepb00p</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
